In [2]:
# %matplotlib inline
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [5]:
len(titles.index)

232330

### What are the earliest two films listed in the titles dataframe?

In [6]:
titles = titles.sort_values(by=['year'])
titles.head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [15]:
hamlet = titles[titles["title"].str.contains("Hamlet")]
hamlet

                                          title  year
46721                                    Hamlet  1910
209878                                   Hamlet  1911
166410                                   Hamlet  1913
72925                        A Sagebrush Hamlet  1919
98554                                    Hamlet  1921
99398                        Han, hun og Hamlet  1922
24178                        Han, hun og Hamlet  1932
6009                                     Hamlet  1948
128388                                   Hamlet  1954
182970                                   Hamlet  1964
227105                              Hamlet (II)  1964
122704                                   Hamlet  1969
221479                                   Hamlet  1973
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
92146                                    Hamlet  1976
24284               Intikam Melegi/Kadin Hamlet  1976
94355                                    Hamlet  1987
114431                   Hamlet liikemaailmassa  1987
7670                  Hamlet: Prince of Denmark  1989
45350                                    Hamlet  1990
192443                             H for Hamlet  1993
14317                     Green Eggs and Hamlet  1995
151918                              Fuck Hamlet  1996
201291                                   Hamlet  1996
17419                 Hamlet, Prince of Denmark  1997
94554                                    Hamlet  2000
223618                   Hamlet in the Hamptons  2002
37146                                  Hamlet_X  2003
174293                                 Hamlet X  2004
8582                                Hamlet (II)  2005
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
163471                              Hamlet (II)  2007
44682                              Hamlet (III)  2007
71152   The Tragedy of Hamlet Prince of Denmark  2007
172418                Hamlet the Vampire Slayer  2008
98086                                  Hamlet 2  2008
176069                                   Hamlet  2009
211393                           Kitchen Hamlet  2009
102919                                   Hamlet  2011
167861                            Zombie Hamlet  2012
15183                            Hamlet Unbound  2012
83789                       Harry, Hamlet and I  2013
223568                                   Hamlet  2014
143184                            Hamlet A.D.D.  2014
8865                                Hamlet (II)  2015
39230                  Hamlet, Son of a Kingpin  2015
168965                                   Hamlet  2015
195089                           Hamlet's Ghost  2015
113096                             Hamlet (III)  2016
109367                            Hamlet Frezer  2016
193914        Royal Shakespeare Company: Hamlet  2016
42266                               Hamlet (IV)  2016
62549                            Redneck Hamlet  2017
15202             Hamlet: The Fall of a Sparrow  2017

### How many movies are titled "North by Northwest"?

In [16]:
North = titles[titles["title"].str.contains("North by Northwest")]

In [17]:
North

                     title  year
139311  North by Northwest  1959

### When was the first movie titled "Hamlet" made?

In [18]:
hamlet.head(1)

        title  year
46721  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [19]:
ti = titles[titles["title"].str.contains("Treasure Island")]

In [20]:
ti

                                                    title  year
206027                                    Treasure Island  1918
51287                                     Treasure Island  1920
191050                                    Treasure Island  1934
144440                      The Secret of Treasure Island  1938
59773                     Charlie Chan at Treasure Island  1939
96934                                     Treasure Island  1950
187404                          Return to Treasure Island  1954
65156                           Five on a Treasure Island  1957
89534                                     Treasure Island  1972
111343                                    Treasure Island  1973
205397                                    Treasure Island  1985
130842                             Muppet Treasure Island  1996
153428                               Treasure Island (II)  1999
179354                                    Treasure Island  1999
223604  Treasure Island Kids: The Monster of Treasure ...  2006
217992  Treasure Island Kids: The Battle of Treasure I...  2006
28183                          Pirates of Treasure Island  2006
180487  Treasure Island Kids: The Mystery of Treasure ...  2006
191707             National Theatre Live: Treasure Island  2015

### How many movies were made in the year 1950?

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

### In what years has a movie titled "Batman" been released?

### How many roles were there in the movie "Inception"?

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

### But how many roles in the movie "Inception" did receive an "n" value?

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

### How many roles were credited in Branagh’s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?